# TemporaryGraphicsCommandData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TemporaryGraphicsCommandData Properties
TemporaryGraphicsCommandData Class See Also
---
The TemporaryGraphicsCommandData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document. |
| Index | The unique index of the temporary graphics object managed by TemporaryGraphicsManager. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace